In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
df = pd.read_csv('Default_Fin.csv')

In [5]:
df.head()

   Index  Employed  Bank Balance  Annual Salary  Defaulted?
0      1         1       8754.36      532339.56           0
1      2         0       9806.16      145273.56           0
2      3         1      12882.60      381205.68           0
3      4         1       6351.00      428453.88           0
4      5         1       9427.92      461562.00           0

In [4]:
df.isna().sum()

Index            0
Employed         0
Bank Balance     0
Annual Salary    0
Defaulted?       0
dtype: int64

In [23]:
df.corr()

                  Index  Employed  Bank Balance  Annual Salary  Defaulted?
Index          1.000000 -0.002597      0.010342      -0.001427   -0.005135
Employed      -0.002597  1.000000     -0.203578       0.753985   -0.035420
Bank Balance   0.010342 -0.203578      1.000000      -0.152243    0.350119
Annual Salary -0.001427  0.753985     -0.152243       1.000000   -0.019871
Defaulted?    -0.005135 -0.035420      0.350119      -0.019871    1.000000

In [45]:
df.describe()

             Index      Employed  Bank Balance  Annual Salary    Defaulted?
count  10000.00000  10000.000000  10000.000000   10000.000000  10000.000000
mean    5000.50000      0.705600  10024.498524  402203.782224      0.033300
std     2886.89568      0.455795   5804.579486  160039.674988      0.179428
min        1.00000      0.000000      0.000000    9263.640000      0.000000
25%     2500.75000      0.000000   5780.790000  256085.520000      0.000000
50%     5000.50000      1.000000   9883.620000  414631.740000      0.000000
75%     7500.25000      1.000000  13995.660000  525692.760000      0.000000
max    10000.00000      1.000000  31851.840000  882650.760000      1.000000

In [47]:
df.drop('Index', axis=1, inplace=True)

###### Dividing the data

In [48]:
y = df['Defaulted?']
x = df.drop('Defaulted?', axis=1)

In [7]:
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import confusion_matrix, accuracy_score, classification_report
from sklearn.model_selection import train_test_split

###### Splitting the dataset

In [49]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=.3, random_state = 42)

In [50]:
model = LogisticRegression(random_state=4)

In [51]:
model.fit(x_train, y_train)

LogisticRegression(random_state=4)

###### Make prediction

In [52]:
prediction = model.predict(x_test)

###### Test Model

In [54]:
accuracy = accuracy_score(y_test, prediction)

print('Model performance: ', model.score(x_train, y_train))
print('Prediction performance: ', accuracy)

Model performance:  0.9652857142857143
Prediction performance:  0.9683333333333334

In [55]:
print(confusion_matrix(y_test, prediction))

[[2905    1]
 [  94    0]]

In [56]:
print(classification_report(y_test, prediction))

              precision    recall  f1-score   support

           0       0.97      1.00      0.98      2906
           1       0.00      0.00      0.00        94

    accuracy                           0.97      3000
   macro avg       0.48      0.50      0.49      3000
weighted avg       0.94      0.97      0.95      3000

In [115]:
df[df['Defaulted?']==1]

      Employed  Bank Balance  Annual Salary  Defaulted?
136          0      17844.00      214252.80           1
173          0      26469.60      171257.88           1
201          0      21296.28      244314.12           1
206          1      22675.20      587474.04           1
209          0      22792.68      247862.40           1
...        ...           ...            ...         ...
9912         1      25786.80      531719.04           1
9921         0      19534.80      210564.00           1
9949         1      21003.00      618947.28           1
9951         1      18187.32      584262.12           1
9978         1      26429.52      567447.12           1

[333 rows x 4 columns]

In [111]:
kolde = np.array([[0, 577877, 46666]])

In [110]:
model.predict(kolde)

array([1], dtype=int64)